/*:
 
 # 关于协议和扩展的学习

 示例代码是《Swift开发进阶教程》实例代码.

 在XCode-Menu-Editor（Show Rendered Mark）中进行切换显示。
 
 语言版本: Swift 5.x
 
 IDE: Xcode 13.4.x
 
 
 ## 内容一览
 
 1. [协议概念](01-协议概念)
 1. [协议和范型混合使用](02-协议和范型混合使用)
 1. [协议关联类型的检查](03-协议关联类型的检查)
 1. [协议关联类型的约束](04-协议关联类型的约束)
 1. [类继承和协议继承](05-类继承和协议继承)
 1. [协议扩展中的构造方法-1](06-协议扩展中的构造方法-1)
 1. [协议扩展中的构造方法-2](06-协议扩展中的构造方法-2)
 1. [扩展Built-in数据类型](07-扩展Built-in数据类型)
 1. [协议的交集](08-协议的交集)
 1. [方法的调用优先级顺序](09-方法的调用优先级顺序)
 1. [扩展遵循指定的协议](10-扩展遵循指定的协议)
*/

//: [Next](@next)


